In [2]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
from pandas import Series, DataFrame

In [5]:
obj=pd.Series([4,7,-5,3])

In [6]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [7]:
obj.array

<NumpyExtensionArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [8]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])

In [10]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [11]:
obj2["a"]

-5

In [12]:
obj2["d"] = 6

In [13]:
obj2[["c", "a", "d"]]  #obj2["c", "a", "d"] cannot work, only for 1.

c    3
a   -5
d    6
dtype: int64

In [14]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [15]:
obj2*2

d    12
b    14
a   -10
c     6
dtype: int64

In [16]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [17]:
"b" in obj2

True

In [18]:
"e" in obj2

False

In [19]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}

In [20]:
obj3 = pd.Series(sdata)

In [21]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [22]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [23]:
states = ["California", "Ohio", "Oregon", "Texas"]

In [24]:
obj4 = pd.Series(sdata, index=states)

In [25]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [26]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [27]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [28]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [29]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [30]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [31]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [32]:
obj4.name = "population"

In [33]:
obj4.index.name = "state"

In [34]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [35]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [36]:
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]

In [37]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [38]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [39]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [40]:
frame.head() #selects first 5 rows

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [41]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [42]:
pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [43]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])

In [44]:
frame2 #MISSING VALUES

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [45]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [46]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [47]:
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [48]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [49]:
frame2["debt"] = 16.5

In [50]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [51]:
frame2["debt"] = np.arange(6.)

In [52]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [53]:
val = pd.Series([-1.2, -1.5, -1.7], index=[2,4,5])

In [54]:
frame2["debt"] = val

In [55]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [56]:
frame2["eastern"] = frame2["state"] == "Ohio"

In [57]:
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6  -1.2     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9  -1.5    False
5  2003  Nevada  3.2  -1.7    False

In [58]:
del frame2["eastern"]

In [59]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6}, "Nevada": {2001: 2.4, 2002: 2.9}}

In [60]:
frame3 = pd.DataFrame(populations)

In [61]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [62]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [63]:
pd.DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [64]:
pdata = {"Ohio": frame3["Ohio"][:-1], "Nevada": frame3["Nevada"][:2]}

In [65]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [66]:
frame3.index.name = "year"

In [67]:
frame3.columns.name = "state"

In [68]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [69]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [70]:
obj = pd.Series(np.arange(3), index=["a", "b", "c"])

In [71]:
index = obj.index

In [72]:
index

Index(['a', 'b', 'c'], dtype='object')

In [73]:
labels = pd.Index(np.arange(3))

In [74]:
labels

Index([0, 1, 2], dtype='int32')

In [75]:
obj2 = pd.Series([1.5, -2.5, 0], index= labels)

In [76]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [77]:
obj2.index is labels

True

In [78]:
#can have duplicate indexes

In [79]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])

In [80]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [81]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])

In [82]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [83]:
obj3 = pd.Series(["blue", "purple", "yellow"], index=[0,2,4])

In [84]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [85]:
obj3.reindex(np.arange(6), method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [86]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                     index=["a", "c", "d"],
                     columns=["Ohio", "Texas", "California"])

In [87]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [88]:
frame2 = frame.reindex(index=["a", "b", "c", "d"])

In [89]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [90]:
states = ["Texas", "Utah", "California"]

In [91]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [92]:
frame.reindex(states, axis="columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [93]:
frame.loc[["a","d","c"], ["California", "Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

In [94]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])

In [95]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [96]:
new_obj = obj.drop("c")

In [97]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [98]:
obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [99]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                        index=["Ohio", "Colorado", "Utah", "New York"],
                        columns=["one", "two", "three", "four"])

In [100]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [101]:
data.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [102]:
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [103]:
data.drop("two", axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [104]:
obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])

In [105]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [106]:
obj["b"]

1.0

In [107]:
obj[1]

C:\Users\TRUTH\AppData\Local\Temp\ipykernel_8972\2469632899.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[1]

1.0

In [108]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [109]:
obj[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [110]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [111]:
obj.loc[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [112]:
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])

In [113]:
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])

In [114]:
obj1

2    1
0    2
1    3
dtype: int64

In [115]:
obj2

a    1
b    2
c    3
dtype: int64

In [116]:
obj1[[0,1,2]]

0    2
1    3
2    1
dtype: int64

In [117]:
obj2[[0,1,2]]

C:\Users\TRUTH\AppData\Local\Temp\ipykernel_8972\2179584337.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj2[[0,1,2]]

a    1
b    2
c    3
dtype: int64

In [118]:
obj1.iloc[[0,1,2]]

2    1
0    2
1    3
dtype: int64

In [119]:
obj2.iloc[[0,1,2]] #obj2.loc[[0, 1]] does not work

a    1
b    2
c    3
dtype: int64

In [120]:
obj2.loc["b":"c"] = 5

In [121]:
obj2

a    1
b    5
c    5
dtype: int64

In [122]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                        index=["Ohio", "Colorado", "Utah", "New York"],
                        columns=["one", "two", "three", "four"])

In [123]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [124]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [125]:
data[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [126]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [127]:
data[data["three"]>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [128]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [129]:
data[data<5]=0

In [130]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [131]:
data.loc["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [132]:
data.loc[["Colorado", "New York"]]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

In [133]:
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int32

In [134]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [135]:
data.iloc[[2,1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    0    5      6     7

In [136]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [137]:
data.iloc[[1,2], [3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [138]:
data.loc[:"Utah", "two"]

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [139]:
data.iloc[:, :3][data.three>5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [140]:
data.loc[data.three >= 2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [141]:
data.loc[:, "one"] = 1

In [142]:
data.iloc[2] = 5

In [143]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        5    5      5     5
New York    1   13     14    15

In [144]:
data.loc[data["four"] > 5] = 3

In [145]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [146]:
data.loc[data.three == 5, "three"] = 6

In [147]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])

In [148]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
                index=["a", "c", "e", "f", "g"])

In [149]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [150]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [151]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [152]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"),
                       index=["Ohio", "Texas", "Colorado"])

In [153]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
                       index=["Utah", "Ohio", "Texas", "Oregon"])

In [154]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [155]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [156]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [157]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                    columns=list("abcd"))

In [158]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                       columns=list("abcde"))

In [160]:
df2.loc[1, "b"] = np.nan

In [161]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [162]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [163]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [165]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [166]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [167]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [168]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [169]:
arr = np.arange(12.).reshape((3,4))

In [170]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [171]:
arr[0]

array([0., 1., 2., 3.])

In [172]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [173]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                         columns=list("bde"),
                         index=["Utah", "Ohio", "Texas", "Oregon"])

In [174]:
series = frame.iloc[0]

In [175]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [176]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [177]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [178]:
series2 = pd.Series(np.arange(3), index=["b", "e", "f"])

In [179]:
series2

b    0
e    1
f    2
dtype: int32

In [180]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [181]:
series3 = frame["d"]

In [182]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [183]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [184]:
frame.sub(series3, axis="index")

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [185]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)),
                         columns=list("bde"),
                         index=["Utah", "Ohio", "Texas", "Oregon"])

In [186]:
frame

               b         d         e
Utah    1.406504 -0.091804 -1.118955
Ohio   -0.361126  1.758625 -0.734290
Texas   1.259741  1.559437 -0.661386
Oregon -0.908680 -1.845070 -0.144384

In [187]:
np.abs(frame)

               b         d         e
Utah    1.406504  0.091804  1.118955
Ohio    0.361126  1.758625  0.734290
Texas   1.259741  1.559437  0.661386
Oregon  0.908680  1.845070  0.144384

In [189]:
def f1(x):
    return x.max()-x.min()

In [193]:
frame.apply(f1) #applies across rows, top to bottom

b    2.315184
d    3.603695
e    0.974571
dtype: float64

In [192]:
frame.apply(f1, axis="columns") # Apply across the columns, left to right

Utah      2.525460
Ohio      2.492915
Texas     2.220823
Oregon    1.700686
dtype: float64

In [194]:
def f2(x):
    return pd.Series([x.min(), x.max()], index=["min", "max"])

In [195]:
frame.apply(f2)

            b         d         e
min -0.908680 -1.845070 -1.118955
max  1.406504  1.758625 -0.144384

In [196]:
def my_format(x):
    return f"{x:.2f}"

In [197]:
frame.applymap(my_format)

C:\Users\TRUTH\AppData\Local\Temp\ipykernel_8972\1462544007.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  frame.applymap(my_format)

            b      d      e
Utah     1.41  -0.09  -1.12
Ohio    -0.36   1.76  -0.73
Texas    1.26   1.56  -0.66
Oregon  -0.91  -1.85  -0.14

frame["e"].map(my_format)

In [200]:
frame.map(my_format)

            b      d      e
Utah     1.41  -0.09  -1.12
Ohio    -0.36   1.76  -0.73
Texas    1.26   1.56  -0.66
Oregon  -0.91  -1.85  -0.14

In [201]:
obj = pd.Series(np.arange(4), index=["d", "a", "b", "c"])

In [202]:
obj

d    0
a    1
b    2
c    3
dtype: int32

In [203]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [204]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                         index=["three", "one"],
                         columns=["d", "a", "b", "c"])

In [205]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [206]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [209]:
frame.sort_index(axis="columns") #ascending=False

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [210]:
obj = pd.Series([4, 7, -3, 2])

In [212]:
obj.sort_values() #na_position="first" will put NAN values to front

2   -3
3    2
0    4
1    7
dtype: int64

In [213]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [215]:
obj.rank() #assigns a rank from 1 and can be handled differently with duplicates. Lowest number
#has lowest rank, highest highest unless otherwise called for

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [216]:
obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])

In [217]:
obj.index.is_unique

False

In [218]:
obj["a"]

a    0
a    1
dtype: int32

In [219]:
obj["c"]

4

In [220]:
df = pd.DataFrame(np.random.standard_normal((5, 3)),
                      index=["a", "a", "b", "b", "c"])

In [221]:
df

          0         1         2
a -1.475614 -0.190466  1.092570
a  0.322621 -1.345106 -1.516419
b  0.738547  1.211100 -0.469218
b -1.528412 -0.865975  0.138373
c  0.807677  0.111751  1.290372

In [222]:
df.loc["b"]

          0         1         2
b  0.738547  1.211100 -0.469218
b -1.528412 -0.865975  0.138373

In [223]:
df.loc["c"]

0    0.807677
1    0.111751
2    1.290372
Name: c, dtype: float64

In [224]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                       [np.nan, np.nan], [0.75, -1.3]],
                      index=["a", "b", "c", "d"],
                      columns=["one", "two"])

In [225]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [226]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [227]:
df.sum(axis="columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [229]:
df.sum(axis="columns", skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [231]:
df.mean(axis="columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [234]:
df.idxmax()

<bound method NDFrame.get of one    b
two    d
dtype: object>

In [238]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [239]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [240]:
obj = pd.Series(["a", "a", "b", "c"] * 4)

In [241]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [242]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [244]:
price = pd.read_pickle("textbook/examples/yahoo_price.pkl")

In [245]:
price

                  AAPL        GOOG         IBM       MSFT
Date
2010-01-04   27.990226  313.062468  113.304536  25.884104
2010-01-05   28.038618  311.683844  111.935822  25.892466
2010-01-06   27.592626  303.826685  111.208683  25.733566
2010-01-07   27.541619  296.753749  110.823732  25.465944
2010-01-08   27.724725  300.709808  111.935822  25.641571
...                ...         ...         ...        ...
2016-10-17  117.550003  779.960022  154.770004  57.220001
2016-10-18  117.470001  795.260010  150.720001  57.660000
2016-10-19  117.120003  801.500000  151.259995  57.529999
2016-10-20  117.059998  796.969971  151.520004  57.250000
2016-10-21  116.599998  799.369995  149.630005  59.660000

[1714 rows x 4 columns]

In [246]:
volume = pd.read_pickle("textbook/examples/yahoo_volume.pkl")

In [247]:
volume

                 AAPL      GOOG       IBM      MSFT
Date
2010-01-04  123432400   3927000   6155300  38409100
2010-01-05  150476200   6031900   6841400  49749600
2010-01-06  138040000   7987100   5605300  58182400
2010-01-07  119282800  12876600   5840600  50559700
2010-01-08  111902700   9483900   4197200  51197400
...               ...       ...       ...       ...
2016-10-17   23624900   1089500   5890400  23830000
2016-10-18   24553500   1995600  12770600  19149500
2016-10-19   20034600    116600   4632900  22878400
2016-10-20   24125800   1734200   4023100  49455600
2016-10-21   22384800   1260500   4401900  79974200

[1714 rows x 4 columns]

In [248]:
returns = price.pct_change()

In [249]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [250]:
returns["MSFT"].corr(returns["IBM"])

0.4997636114415114

In [251]:
returns["MSFT"].cov(returns["IBM"])

8.870655479703546e-05

In [252]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [253]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [254]:
returns.corrwith(returns["IBM"])

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [255]:
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

In [256]:
obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])

In [257]:
uniques = obj.unique()

In [258]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [259]:
obj.value_counts()

c    3
a    3
b    2
d    1
Name: count, dtype: int64

In [260]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [261]:
mask = obj.isin(["b", "c"])

In [262]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [263]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object